<!DOCTYPE html>
<html>
    <head>
    <!-- hexo-inject:begin --><!-- hexo-inject:end --><!-- Title -->
    
    <title>
        西游记中，为什么十万天兵拿不住孙悟空，但一个妖怪就让孙悟空吃尽苦头？ | AI
    </title>
    
    <!-- Favicons -->
    <link rel="icon shortcut" type="image/ico" href="/img/zebra.png">
    <link rel="icon" sizes="192x192" href="/img/zebra.png">
    <link rel="apple-touch-icon" href="/img/zebra.png">
    
    <!-- Meta & INfo -->
    <meta charset="utf-8">
    <meta http-equiv="X-UA-Compatible">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <meta name="theme-color" content="#0097A7">
    <meta name="author" content="Mahome.liao">
    <meta name="description" content="LIAOLUO knows nothing.">
    <meta name="keywords" content="跟着我走，你会降维">
    
    <!--iOS -->
    <meta name="viewport" content="width=device-width, initial-scale=1, user-scalable=no">
    <meta name="apple-mobile-web-app-title" content="Title">
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <meta name="HandheldFriendly" content="True">
    <meta name="MobileOptimized" content="480">
    
    <!-- Add to homescreen for Chrome on Android -->
    <meta name="mobile-web-app-capable" content="yes">
    
    <!-- Add to homescreen for Safari on iOS -->
    <meta name="apple-mobile-web-app-capable" content="yes">
    <meta name="apple-mobile-web-app-status-bar-style" content="black">
    <meta name="apple-mobile-web-app-title" content="AI">
    
    <!-- The Open Graph protocol -->
    <meta property="og:url" content="http://yoursite.com">
    <meta property="og:type" content="blog">
    <meta property="og:title" content="西游记中，为什么十万天兵拿不住孙悟空，但一个妖怪就让孙悟空吃尽苦头？ | AI">
    <meta property="og:description" content="LIAOLUO knows nothing.">
    
     <!--[if lte IE 9]>
        <link rel="stylesheet" href="/css/ie-blocker.css">
        
        
            <script src="/js/ie-blocker.zhCN.js"></script>
        
    <![endif]-->
    
    <!-- Import CSS -->
    <link rel="stylesheet" href="/css/material.min.css">
    <link rel="stylesheet" href="/css/style.min.css">
    <!-- Config CSS -->


<!-- Other Styles -->
<style>
	body, html{
		font-family: Roboto, "Helvetica Neue", Helvetica, "PingFang SC", "Hiragino Sans GB", "Microsoft YaHei", "微软雅黑", Arial, sans-serif;
	}
	
    a{
        color: #00838F
    }
    
    .mdl-card__media,
    #search-label,
    #search-form-label:after,
    #scheme-Paradox .hot_tags-count,
    #scheme-Paradox .sidebar_archives-count,
    #scheme-Paradox .sidebar-colored .sidebar-header,
    #scheme-Paradox .sidebar-colored .sidebar-badge{
        background-color: #0097A7 !important
    }
    
	/* Sidebar User Drop Down Menu Text Color */
	#scheme-Paradox .sidebar-colored .sidebar-nav>.dropdown>.dropdown-menu>li>a:hover,
    #scheme-Paradox .sidebar-colored .sidebar-nav>.dropdown>.dropdown-menu>li>a:focus{
        color: #0097A7 !important
    }
    
    #post_entry-right-info,
    .sidebar-colored .sidebar-nav li:hover > a,
    .sidebar-colored .sidebar-nav li:hover > a i,
    .sidebar-colored .sidebar-nav li > a:hover,
    .sidebar-colored .sidebar-nav li > a:hover i,
    .sidebar-colored .sidebar-nav li > a:focus i,
    .sidebar-colored .sidebar-nav > .open > a,
    .sidebar-colored .sidebar-nav > .open > a:hover,
    .sidebar-colored .sidebar-nav > .open > a:focus,
    #ds-reset #ds-ctx .ds-ctx-entry .ds-ctx-head a{
        color: #0097A7 !important
    }
    
    .toTop{
        background: #757575 !important
    }
		
	.material-layout .material-post>.material-nav,
	.material-layout .material-index>.material-nav,
	.material-nav a{
		color: #757575;
	}
		
	#scheme-Paradox .MD-burger-layer {
		background-color: #757575;
	}

	#scheme-Paradox #post-toc-trigger-btn{
		color: #757575;
	}
	
	.post-toc a:hover{
		color: #00838F;
		text-decoration: underline;
	}
</style>


<!-- Theme Background Related-->

    <style>
        body{
            background-color: #F5F5F5
        }
		
		/* blog_info bottom background */
        #scheme-Paradox .material-layout .something-else .mdl-card__supporting-text{
            background-color: #fff;
        }
    </style>




<!-- Fade Effect -->

    <style>
        .fade {
            transition: all 800ms linear;
            -webkit-transform: translate3d(0,0,0);
            -moz-transform: translate3d(0,0,0);
            -ms-transform: translate3d(0,0,0);
            -o-transform: translate3d(0,0,0);
            transform: translate3d(0,0,0);
            opacity: 1;
        }

        .fade.out{
            opacity: 0;
        }
    </style>

	<script src="/js/jquery.min.js"></script>
	
	<link rel="stylesheet" href="/css/highlight/solarized-white.css">
	
	<!-- UC Browser Compatible-->
	<script>
		var agent = navigator.userAgent.toLowerCase();
		if(agent.indexOf('ucbrowser')>0) {
			document.write('<link rel="stylesheet" href="/css/uc.css">');
		   alert('由于 UC 浏览器使用极旧的内核，而本网站使用了一些新的特性。\n为了您能更好的浏览，推荐使用 Chrome 或 Firefox 浏览器。');
		}
	</script>
    
    <!-- Custom Head --><!-- hexo-inject:begin --><!-- hexo-inject:end -->
    
</head>
	
	

    <body id="scheme-Paradox">

		
        <!-- hexo-inject:begin --><!-- hexo-inject:end --><div class="material-layout  mdl-js-layout has-drawer is-upgraded">
				
			
			
            <!-- Main Container -->
            <main class="material-layout__content" id="main">
				
                <!-- Top Anchor -->
                <div id="top"></div>
				
				
                <!-- Hamburger Button -->
                <button class="MD-burger-icon sidebar-toggle">
                    <span class="MD-burger-layer"></span>
                </button>
				
				
                
	<!-- Back Button -->
<!--
	<div class="material-back" id="backhome-div" tabindex="0">
		<a class="mdl-button mdl-js-button mdl-js-ripple-effect mdl-button--icon" href="#" onclick="window.history.back();return false;" target="_self" role="button" data-upgraded=",MaterialButton,MaterialRipple">
			<i class="material-icons" role="presentation">arrow_back</i>
			<span class="mdl-button__ripple-container">
				<span class="mdl-ripple"></span>
			</span>
		</a>
	</div>			
-->
	<!-- Left aligned menu below button -->
	<button id="post-toc-trigger-btn"
			class="mdl-button mdl-js-button mdl-button--icon">
	  <i class="material-icons">format_list_numbered</i>
	</button>

	<ul class="post-toc-wrap mdl-menu mdl-menu--bottom-left mdl-js-menu mdl-js-ripple-effect"
		for="post-toc-trigger-btn">
			
			
		
<!--			<li class="mdl-menu__item">Some Action</li>-->
	</ul>


<!-- Layouts -->

    <!-- Post Module -->
    <div class="material-post_container">
		
        <div class="material-post mdl-grid">
            <div class="mdl-card mdl-shadow--4dp mdl-cell mdl-cell--12-col">

                <!-- Post Header(Thumbnail & Title) -->
                
	<!-- Paradox Post Header -->
	
		
			<!-- Random Thumbnail -->
			<div class="post_thumbnail-random mdl-card__media mdl-color-text--grey-50">
				<script>
    
    var randomNum;
    randomNum = Math.floor(Math.random() * 6 + 1);
    
    $(".post_thumbnail-random").css('background-image', 'url(' + '/img/random/' + randomNum + '.png' + ')');
    
</script>

		
	
        <p class="article-headline-p">
            西游记中，为什么十万天兵拿不住孙悟空，但一个妖怪就让孙悟空吃尽苦头？
        </p>
    </div>

	

				
				
					<!-- Paradox Post Info -->
					<div class="mdl-color-text--grey-700 mdl-card__supporting-text meta">
    
    <!-- Author Avatar -->
    <div id="author-avatar">
        <img src="/img/zebra.png" width="44px" height="44px" alt="Author Avatar"/>
    </div>
    <!-- Author Name & Date -->
    <div>
        <strong>Mahome.liao</strong>
        <span>10月 06, 2017</span>
    </div>
    
    <div class="section-spacer"></div>
	
    <!-- Favorite -->
<!--
    <button id="article-functions-like-button" class="mdl-button mdl-js-button mdl-js-ripple-effect mdl-button--icon btn-like">
        <i class="material-icons" role="presentation">favorite</i>
        <span class="visuallyhidden">favorites</span>
    </button>
-->
    
    <!-- Tags (bookmark) -->
    <button id="article-functions-viewtags-button" class="mdl-button mdl-js-button mdl-js-ripple-effect mdl-button--icon">
        <i class="material-icons" role="presentation">bookmark</i>
        <span class="visuallyhidden">bookmark</span>
    </button>
    <ul class="mdl-menu mdl-menu--bottom-right mdl-js-menu mdl-js-ripple-effect" for="article-functions-viewtags-button">
        <li class="mdl-menu__item">
        
    </ul>
    
    <!-- Share -->
    <button id="article-fuctions-share-button" class="mdl-button mdl-js-button mdl-js-ripple-effect mdl-button--icon">
    <i class="material-icons" role="presentation">share</i>
    <span class="visuallyhidden">share</span>
</button>
<ul class="mdl-menu mdl-menu--bottom-right mdl-js-menu mdl-js-ripple-effect" for="article-fuctions-share-button">
    
    
    
    
    
    <!-- Share Twitter -->
    <a class="post_share-link" href="https://twitter.com/intent/tweet?text=西游记中，为什么十万天兵拿不住孙悟空，但一个妖怪就让孙悟空吃尽苦头？&url=http://yoursite.com//2017/10/06/西游记_孙悟空/index.html&via=Mahome.liao" target="_blank">
        <li class="mdl-menu__item">
            分享到 Twitter
        </li>
    </a>
    
    <!-- Share Google+ -->
    <a class="post_share-link" href="https://plus.google.com/share?url=http://yoursite.com//2017/10/06/西游记_孙悟空/index.html" target="_blank">
        <li class="mdl-menu__item">
            分享到 Google+
        </li>
    </a>
    
    <!-- Share Weibo -->
    <a class="post_share-link" href="http://service.weibo.com/share/share.php?appkey=&title=西游记中，为什么十万天兵拿不住孙悟空，但一个妖怪就让孙悟空吃尽苦头？&url=http://yoursite.com//2017/10/06/西游记_孙悟空/index.html&pic=&searchPic=false&style=simple" target="_blank">
        <li class="mdl-menu__item">
            分享到微博
        </li>
    </a>
</ul>
</div>
				

                <!-- Post Content -->
                <div id="post-content" class="markdown-Github mdl-color-text--grey-700 mdl-card__supporting-text fade out">
	
		<p>&gt;<br>&#x4F5C;&#x8005;&#xFF1A;&#x9648;&#x91CE;&#x4EAE;<br>&#x94FE;&#x63A5;&#xFF1A;<a href="https://www.zhihu.com/question/39421556/answer/271001086" target="_blank" rel="external">https://www.zhihu.com/question/39421556/answer/271001086</a><br>&#x6765;&#x6E90;&#xFF1A;&#x77E5;&#x4E4E;<br>&#x8457;&#x4F5C;&#x6743;&#x5F52;&#x4F5C;&#x8005;&#x6240;&#x6709;&#xFF0C;&#x8F6C;&#x8F7D;&#x8BF7;&#x8054;&#x7CFB;&#x4F5C;&#x8005;&#x83B7;&#x5F97;&#x6388;&#x6743;&#x3002;</p>
<p><img src="/2017/10/06/&#x897F;&#x6E38;&#x8BB0;_&#x5B59;&#x609F;&#x7A7A;/wukong1.jpg" alt="&apos;1&apos;"></p>
<p>&#x4F60;&#x5F88;&#x725B;&#x903C;&#x3002;&#x4F60;&#x91D1;&#x521A;&#x4E0D;&#x574F;&#x3001;&#x957F;&#x751F;&#x4E0D;&#x8001;&#xFF0C;&#x4F1A;&#x4E03;&#x5341;&#x4E8C;&#x53D8;&#xFF0C;&#x624B;&#x6301;&#x5B9A;&#x6D77;&#x795E;&#x9488;&#xFF0C;&#x5728;&#x5927;&#x5B66;&#x5F04;&#x4E86;&#x4E2A;&#x975E;&#x6CD5;&#x793E;&#x56E2;&#xFF0C;&#x81EA;&#x79F0;&#x9F50;&#x5929;&#x5927;&#x5723;&#x3002;</p>
<p>&#x6821;&#x957F;&#x6D3E;&#x4E86;&#x5341;&#x4E07;&#x5B66;&#x751F;&#x4F1A;&#x5E72;&#x4E8B;&#x6765;&#x628A;&#x4F60;&#x7684;&#x793E;&#x56E2;&#x70E7;&#x4E86;&#xFF0C;&#x65D7;&#x5B50;&#x6252;&#x4E86;&#x3002;&#x4F60;&#x4E00;&#x6012;&#x4E4B;&#x4E0B;&#xFF0C;&#x6740;&#x5230;&#x5B66;&#x751F;&#x4F1A;&#xFF0C;&#x628A;&#x6574;&#x4E2A;&#x5B66;&#x6821;&#x6405;&#x5F97;&#x5929;&#x7FFB;&#x5730;&#x8986;&#x3002;</p>
<p>&#x6821;&#x957F;&#x6002;&#x4E86;&#xFF0C;&#x8BF4;&#x4ECE;&#x4ECA;&#x5929;&#x8D77;&#x4F60;&#x5C31;&#x662F;&#x5B66;&#x751F;&#x4F1A;&#x5E72;&#x4E8B;&#x4E86;&#xFF0C;&#x4F60;&#x5F88;&#x9AD8;&#x5174;&#xFF0C;&#x80CC;&#x7740;&#x4E66;&#x5305;&#x4E0A;&#x4E86;&#x4E24;&#x5929;&#x5B66;&#xFF0C;&#x5F88;&#x5FEB;&#x5C31;&#x89C9;&#x5F97;&#x81EA;&#x5DF1;&#x88AB;&#x5751;&#x4E86;&#x3002;</p>
<p>&#x4F60;&#x672C;&#x6765;&#x5C31;&#x5DF2;&#x7ECF;&#x5F88;&#x725B;&#x903C;&#x4E86;&#xFF0C;&#x8FD9;&#x4E2A;&#x5B66;&#x6821;&#x4E0D;&#x80FD;&#x8BA9;&#x4F60;&#x53D8;&#x5F97;&#x66F4;&#x725B;&#x903C;&#x3002;&#x800C;&#x4F60;&#x8FD9;&#x4E48;&#x725B;&#x903C;&#x7684;&#x4EBA;&#xFF0C;&#x6821;&#x957F;&#x5C45;&#x7136;&#x8BA9;&#x4F60;&#x5F53;&#x5E72;&#x4E8B;&#x3002;</p>
<p>&#x4F60;&#x5F88;&#x751F;&#x6C14;&#x3002;&#x4F60;&#x62FF;&#x7740;&#x5B9A;&#x6D77;&#x795E;&#x9488;&#x51B2;&#x5230;&#x6821;&#x957F;&#x5BA4;&#xFF0C;&#x628A;&#x6821;&#x957F;&#x65C1;&#x8FB9;&#x7684;&#x4EBA;&#x90FD;&#x63EA;&#x51FA;&#x6765;&#x6253;&#x4E86;&#x4E00;&#x987F;&#xFF0C;&#x8BF4;&#x6821;&#x957F;&#x8F6E;&#x6D41;&#x5750;&#xFF0C;&#x4ECA;&#x5E74;&#x5230;&#x6211;&#x5BB6;&#x3002;</p>
<p>&#x6821;&#x957F;&#x4E5F;&#x5F88;&#x751F;&#x6C14;&#xFF0C;&#x89C9;&#x5F97;&#x4F60;&#x4EE5;&#x524D;&#x4E0D;&#x662F;&#x5E72;&#x4E8B;&#xFF0C;&#x8FD9;&#x4E48;&#x95F9;&#x4E5F;&#x5C31;&#x7B97;&#x4E86;&#xFF0C;&#x73B0;&#x5728;&#x90FD;&#x662F;&#x5E72;&#x4E8B;&#x4E86;&#xFF0C;&#x8FD8;&#x6562;&#x8FD9;&#x4E48;&#x95F9;&#xFF1F;&#x8FD8;&#x8981;&#x4E0D;&#x8981;&#x6BD5;&#x4E1A;&#x8BC1;&#x4E86;&#xFF1F;</p>
<p>&#x4F60;&#x5FAE;&#x5FAE;&#x4E00;&#x7B11;&#xFF0C;&#x4F60;&#x8FD9;&#x4E48;&#x725B;&#x903C;&#xFF0C;&#x6BD5;&#x4E1A;&#x8BC1;&#x5728;&#x4F60;&#x770B;&#x6765;&#x4E0D;&#x8FC7;&#x662F;&#x4E00;&#x5F20;&#x7EB8;&#x800C;&#x5DF2;&#x3002;</p>
<p>&#x4F46;&#x662F;&#x6CA1;&#x60F3;&#x5230;&#x7684;&#x662F;&#xFF0C;&#x6821;&#x957F;&#x8BF7;&#x6765;&#x4E86;&#x9694;&#x58C1;&#x5927;&#x5B66;&#x7684;&#x6821;&#x957F;&#xFF0C;&#x4EBA;&#x5BB6;&#x8FD8;&#x517C;&#x4EFB;&#x516C;&#x5B89;&#x5C40;&#x5C40;&#x957F;&#xFF0C;&#x628A;&#x4F60;&#x6349;&#x5230;&#x7262;&#x91CC;&#x5173;&#x4E86;&#x4E94;&#x767E;&#x5E74;&#x3002;</p>
<p>&#x4E94;&#x767E;&#x5E74;&#x540E;&#xFF0C;&#x6709;&#x4E2A;&#x521B;&#x4E1A;&#x56E2;&#x961F;&#x542C;&#x8BF4;&#x4E86;&#x4F60;&#x7684;&#x4E8B;&#x8FF9;&#xFF0C;&#x6765;&#x62C9;&#x4F60;&#x5165;&#x4F19;&#x3002;&#x4E3A;&#x9996;&#x7684;&#x662F;&#x4E2A;&#x79C3;&#x5B50;&#xFF0C;&#x59D3;&#x5510;&#x3002;</p>
<p>&#x79C3;&#x5B50;&#x8DDF;&#x4F60;&#x8BF4;&#xFF0C;&#x6211;&#x4EEC;&#x7684;&#x521B;&#x4E1A;&#x76EE;&#x6807;&#x662F;&#x5230;&#x5341;&#x4E07;&#x516B;&#x5343;&#x91CC;&#x5916;&#x53D6;&#x56DE;&#x771F;&#x7ECF;&#xFF0C;&#x666E;&#x5EA6;&#x4F17;&#x751F;&#xFF0C;&#x6211;&#x4EEC;&#x662F;&#x975E;&#x5E38;&#x6709;&#x60C5;&#x6000;&#x548C;&#x62C5;&#x5F53;&#x7684;&#x3002;</p>
<p>&#x4F60;&#x4E00;&#x542C;&#xFF0C;&#x4E50;&#x4E86;&#xFF0C;&#x6211;&#x7B4B;&#x6597;&#x4E91;&#x4E00;&#x7FFB;&#x5C31;&#x662F;&#x5341;&#x4E07;&#x516B;&#x5343;&#x91CC;&#xFF0C;&#x4F60;&#x5230;&#x6211;&#x80CC;&#x4E0A;&#x6765;&#xFF0C;&#x6211;&#x5E26;&#x4F60;&#x53BB;&#x3002;</p>
<p>&#x79C3;&#x5B50;&#x4E0D;&#x4EC5;&#x4E0D;&#x9AD8;&#x5174;&#xFF0C;&#x8FD8;&#x5F88;&#x751F;&#x6C14;&#xFF0C;&#x83E9;&#x8428;&#x5DF2;&#x7ECF;&#x89C4;&#x5B9A;&#x4E86;&#xFF0C;&#x6211;&#x4EEC;&#x8981;&#x8D70;&#x5341;&#x4E07;&#x516B;&#x5343;&#x91CC;&#xFF0C;&#x8981;&#x7ECF;&#x4E5D;&#x4E5D;&#x516B;&#x5341;&#x4E00;&#x96BE;&#xFF0C;&#x8FD9;&#x6837;&#x624D;&#x80FD;&#x53D6;&#x5230;&#x771F;&#x7ECF;&#x3002;</p>
<p>&#x4F60;&#x5F88;&#x8D39;&#x89E3;&#xFF0C;&#x4F60;&#x8D70;&#x8FC7;&#x53BB;&#x53D6;&#x7684;&#x7ECF;&#xFF0C;&#x8DDF;&#x4F60;&#x98DE;&#x8FC7;&#x53BB;&#x53D6;&#x7684;&#x7ECF;&#xFF0C;&#x8FD8;&#x80FD;&#x4E0D;&#x4E00;&#x6837;&#x548B;&#x7684;&#xFF1F;&#x4F60;&#x4E0D;&#x662F;&#x4E3A;&#x4E86;&#x666E;&#x5EA6;&#x4F17;&#x751F;&#x5417;&#xFF1F;&#x6211;&#x80CC;&#x4F60;&#x98DE;&#x8FC7;&#x53BB;&#x8FD8;&#x5FEB;&#x70B9;&#xFF0C;&#x4F17;&#x751F;&#x8FD8;&#x7B49;&#x7740;&#x4F60;&#x666E;&#x5EA6;&#x5462;&#x3002;</p>
<p>&#x4F60;&#x5F88;&#x806A;&#x660E;&#xFF0C;&#x4F46;&#x4F60;&#x81EA;&#x59CB;&#x81F3;&#x7EC8;&#x90FD;&#x6CA1;&#x60F3;&#x660E;&#x767D;&#x4E00;&#x4E2A;&#x95EE;&#x9898;&#xFF1A;&#x4F60;&#x8D70;&#x4E5F;&#x597D;&#xFF0C;&#x4F60;&#x98DE;&#x4E5F;&#x597D;&#xFF0C;&#x5BF9;&#x771F;&#x7ECF;&#x6765;&#x8BF4;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x5BF9;&#x5C06;&#x8981;&#x88AB;&#x771F;&#x7ECF;&#x666E;&#x5EA6;&#x7684;&#x4F17;&#x751F;&#x4E5F;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x79C3;&#x5B50;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x79C3;&#x5B50;&#x5DF2;&#x7ECF;&#x662F;&#x88AB;&#x5185;&#x5B9A;&#x7684;&#x4EBA;&#x4E86;&#xFF0C;&#x53EA;&#x8981;&#x8D70;&#x8FD9;&#x4E48;&#x4E00;&#x4E2A;&#x8FC7;&#x573A;&#xFF0C;&#x4ED6;&#x5C31;&#x80FD;&#x8FDB;&#x5165;&#x73ED;&#x5B50;&#x3002;&#x8FD9;&#x4E2A;&#x8FC7;&#x573A;&#x5BF9;&#x4F60;&#x6765;&#x8BF4;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x4F46;&#x662F;&#x5BF9;&#x4E8E;&#x4E0A;&#x9762;&#x7684;&#x4EBA;&#x6765;&#x8BF4;&#x76F8;&#x5F53;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x5E26;&#x7740;&#x7591;&#x60D1;&#x4F60;&#x4E0A;&#x4E86;&#x8DEF;&#xFF0C;&#x7ED3;&#x679C;&#x4F60;&#x53D1;&#x73B0;&#x603B;&#x6709;&#x4E9B;&#x4E0D;&#x5F00;&#x773C;&#x7684;&#x5C0F;&#x5996;&#x6765;&#x9A9A;&#x6270;&#x4F60;&#x3002;&#x4F60;&#x5F88;&#x725B;&#x903C;&#xFF0C;&#x81EA;&#x7136;&#x4E0D;&#x6015;&#x4ED6;&#x4EEC;&#xFF0C;&#x4F46;&#x662F;&#x90A3;&#x4E2A;&#x79C3;&#x5B50;&#x5929;&#x5929;&#x4E2D;&#x62DB;&#x3002;</p>
<p>&#x800C;&#x4E14;&#x90A3;&#x4E9B;&#x5996;&#x602A;&#x6253;&#x7740;&#x6253;&#x7740;&#xFF0C;&#x5C31;&#x90FD;&#x6210;&#x4E86;&#x4E0A;&#x5934;&#x7684;&#x4EBA;&#x7684;&#x4EB2;&#x621A;&#xFF0C;&#x6536;&#x7684;&#x6536;&#xFF0C;&#x653E;&#x7684;&#x653E;&#xFF0C;&#x6700;&#x540E;&#x6B7B;&#x7684;&#x90FD;&#x662F;&#x4F60;&#x4EE5;&#x524D;&#x6DF7;&#x793E;&#x4F1A;&#x8BA4;&#x8BC6;&#x7684;&#x5144;&#x5F1F;&#x3002;</p>
<p>&#x771F;&#x7ECF;&#x53D6;&#x5230;&#x4E86;&#xFF0C;&#x8BBA;&#x529F;&#x884C;&#x8D4F;&#xFF0C;&#x4F60;&#x8BE5;&#x5C45;&#x9996;&#x529F;&#x3002;</p>
<p>&#x4F46;&#x6700;&#x7EC8;&#x662F;&#x79C3;&#x5B50;&#x8FDB;&#x4E86;&#x6838;&#x5FC3;&#x73ED;&#x5B50;&#x3002;&#x4F60;&#x53EA;&#x5206;&#x5230;&#x4E00;&#x4E2A;&#x8FB9;&#x7F18;&#x7684;&#x6240;&#x8C13;&#x201C;&#x6597;&#x6218;&#x80DC;&#x4F5B;&#x201D;&#x7684;&#x5C0F;&#x89D2;&#x8272;&#x3002;</p>
<p>&#x4F46;&#x8FD9;&#x4E2A;&#x65F6;&#x5019;&#x4F60;&#x5DF2;&#x7ECF;&#x53D8;&#x5F97;&#x66F4;&#x52A0;&#x806A;&#x660E;&#x4E86;&#xFF0C;&#x4F60;&#x4EC0;&#x4E48;&#x90FD;&#x6CA1;&#x8BF4;&#x3002;</p>
<p>&#x4F60;&#x4EE5;&#x524D;&#x6CA1;&#x60F3;&#x901A;&#x5F88;&#x591A;&#x95EE;&#x9898;&#xFF1A;&#x4E3A;&#x4EC0;&#x4E48;&#x4E8C;&#x90CE;&#x795E;&#x90A3;&#x4E48;&#x725B;&#x903C;&#x7684;&#x4EBA;&#xFF0C;&#x7518;&#x5F53;&#x4E00;&#x4E2A;&#x5C0F;&#x5C0F;&#x7684;&#x5E72;&#x4E8B;&#xFF0C;&#x5C48;&#x4ECE;&#x4E8E;&#x4E00;&#x4E2A;&#x4EC0;&#x4E48;&#x90FD;&#x4E0D;&#x4F1A;&#x7684;&#x6821;&#x957F;&#x4E4B;&#x4E0B;&#xFF1F;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x660E;&#x660E;&#x516B;&#x6212;&#x3001;&#x6C99;&#x50E7;&#x5565;&#x4E5F;&#x4E0D;&#x884C;&#xFF0C;&#x4E5F;&#x5F97;&#x8DDF;&#x4F60;&#x4E00;&#x8D77;&#x5206;&#x529F;&#x52B3;&#xFF1F;</p>
<p>&#x4E3A;&#x4EC0;&#x4E48;&#x660E;&#x660E;&#x4F17;&#x751F;&#x8FD9;&#x4E48;&#x82E6;&#xFF0C;&#x53EA;&#x8981;&#x53D6;&#x5230;&#x771F;&#x7ECF;&#x5C31;&#x53EF;&#x4EE5;&#x6E21;&#x4ED6;&#x4EEC;&#xFF0C;&#x8FD9;&#x5E2E;&#x4EBA;&#x8FD8;&#x5728;&#x8FD9;&#x91CC;&#x78E8;&#x78E8;&#x5527;&#x5527;&#xFF0C;&#x7ED9;&#x81EA;&#x5DF1;&#x627E;&#x9EBB;&#x70E6;&#xFF1F;</p>
<p>&#x73B0;&#x5728;&#x4F60;&#x660E;&#x767D;&#x4E86;&#x3002;</p>
<p>&#x771F;&#x7ECF;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x4F17;&#x751F;&#x4E5F;&#x4E0D;&#x91CD;&#x8981;&#xFF0C;&#x8C01;&#x6765;&#x505A;&#x8FD9;&#x4EF6;&#x4E8B;&#xFF0C;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x725B;&#x903C;&#xFF0C;&#x4E0D;&#x91CD;&#x8981;&#xFF1B;&#x4F60;&#x4E4B;&#x524D;&#x89C6;&#x4E4B;&#x5982;&#x64E6;&#x5C41;&#x80A1;&#x7EB8;&#x7684;&#x90A3;&#x4E00;&#x5F20;&#x6BD5;&#x4E1A;&#x8BC1;&#xFF0C;&#x5F88;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x7EB5;&#x4F7F;&#x4F60;&#x6709;&#x5929;&#x5927;&#x7684;&#x80FD;&#x8010;&#xFF0C;&#x82E5;&#x662F;&#x4F60;&#x6CA1;&#x6709;&#x8FD9;&#x5C0F;&#x5C0F;&#x7684;&#x4E00;&#x65B9;&#x6BD5;&#x4E1A;&#x8BC1;&#xFF0C;&#x4ED6;&#x4EEC;&#x6C38;&#x8FDC;&#x4E5F;&#x4E0D;&#x4F1A;&#x628A;&#x4F60;&#x5F53;&#x505A;&#x81EA;&#x5DF1;&#x4EBA;&#x3002;&#x4F60;&#x6BD5;&#x4E1A;&#x540E;&#x53EA;&#x80FD;&#x53BB;&#x5F53;&#x725B;&#x9B54;&#x738B;&#x3001;&#x9ED1;&#x718A;&#x7CBE;&#x3002;</p>
<p>&#x60F3;&#x60F3;&#x725B;&#x9B54;&#x738B;&#x7F62;&#xFF1A;&#x4ED6;&#x6D1E;&#x5E9C;&#x88AB;&#x6BC1;&#x4E86;&#xFF0C;&#x5C0F;&#x59BE;&#x88AB;&#x4F60;&#x4E00;&#x68D2;&#x5B50;&#x6253;&#x6B7B;&#x4E86;&#xFF0C;&#x513F;&#x5B50;&#x88AB;&#x89C2;&#x97F3;&#x6536;&#x8D70;&#x4ECE;&#x6B64;&#x89C1;&#x4E0D;&#x4E86;&#x9762;&#x4E86;&#x3002;</p>
<p>&#x8FD9;&#x5C31;&#x662F;&#x4E0D;&#x662F;&#x201C;&#x81EA;&#x5DF1;&#x4EBA;&#x201D;&#x7684;&#x4E0B;&#x573A;&#x3002;</p>
<p>&#x4F46;&#x4F60;&#x82E5;&#x6709;&#x4E86;&#x8FD9;&#x4E00;&#x65B9;&#x6BD5;&#x4E1A;&#x8BC1;&#xFF0C;&#x4F60;&#x7684;&#x725B;&#x903C;&#x4FBF;&#x6709;&#x4E86;&#x51FA;&#x5904;&#xFF0C;&#x4F60;&#x7684;&#x8EAB;&#x5BB6;&#x6709;&#x4E86;&#x7740;&#x843D;&#xFF0C;&#x4ED6;&#x4EEC;&#x8C01;&#x89C1;&#x4E86;&#x4F60;&#x90FD;&#x5F97;&#x606D;&#x606D;&#x656C;&#x656C;&#x5730;&#x5BF9;&#x4F60;&#x4E00;&#x62F1;&#x624B;&#xFF0C;&#x7EB5;&#x4F7F;&#x4F60;&#x662F;&#x53EA;&#x7334;&#x5B50;&#x3002;</p>
<p>&#x4F60;&#x4ECE;&#x524D;&#x5F88;&#x59D4;&#x5C48;&#x4E3A;&#x4EC0;&#x4E48;&#x4F60;&#x8FD9;&#x4E48;&#x725B;&#x903C;&#x53EA;&#x8BA9;&#x4F60;&#x5F53;&#x4E00;&#x4E2A;&#x5E72;&#x4E8B;&#x3002;&#x4F46;&#x662F;&#x4F60;&#x6CA1;&#x6709;&#x60F3;&#x8FC7;&#xFF1A;&#x5982;&#x679C;&#x4F60;&#x4E00;&#x53BB;&#x5C31;&#x8BA9;&#x4F60;&#x5F53;&#x5B66;&#x751F;&#x4F1A;&#x4E3B;&#x5E2D;&#xFF0C;&#x4F60;&#x90A3;&#x4E9B;&#x5B66;&#x751F;&#x4F1A;&#x540C;&#x4E8B;&#x4F1A;&#x600E;&#x4E48;&#x60F3;&#xFF1F;&#x539F;&#x6765;&#x7684;&#x5B66;&#x751F;&#x4F1A;&#x4E3B;&#x5E2D;&#x600E;&#x4E48;&#x60F3;&#xFF1F;</p>
<p>&#x4E00;&#x65F6;&#x95F4;&#xFF0C;&#x4F60;&#x6709;&#x79CD;&#x9519;&#x89C9;&#xFF1A;&#x5728;&#x4F60;&#x6700;&#x65E0;&#x62D8;&#x65E0;&#x675F;&#x7684;&#x90A3;&#x6BB5;&#x65F6;&#x95F4;&#xFF0C;&#x4F60;&#x662F;&#x6700;&#x725B;&#x903C;&#x7684;&#xFF0C;&#x73B0;&#x5728;&#x53CD;&#x800C;&#x662F;&#x5728;&#x8D70;&#x4E0B;&#x5761;&#x8DEF;&#x3002;</p>
<p>&#x4F60;&#x63E1;&#x7D27;&#x624B;&#x4E2D;&#x7684;&#x91D1;&#x7B8D;&#x68D2;&#x3002;&#x4F60;&#x77E5;&#x9053;&#x4E0D;&#x662F;&#x8FD9;&#x6837;&#x7684;&#x3002;&#x4F60;&#x4E00;&#x76F4;&#x90FD;&#x5F88;&#x725B;&#x903C;&#x3002;</p>
<p>&#x53EA;&#x662F;&#x4F60;&#x540E;&#x6765;&#x60F3;&#x660E;&#x767D;&#x4E86;&#x4E00;&#x4EF6;&#x4E8B;&#xFF1A;&#x725B;&#x903C;&#x5E76;&#x4E0D;&#x662F;&#x90A3;&#x4E48;&#x91CD;&#x8981;&#x3002;</p>
<p>&#x5982;&#x679C;&#x725B;&#x903C;&#x91CD;&#x8981;&#xFF0C;&#x4F60;&#x89C1;&#x5230;&#x90A3;&#x4E2A;&#x79C3;&#x5B50;&#x7684;&#x4E00;&#x77AC;&#x95F4;&#xFF0C;&#x5C31;&#x8BE5;&#x7528;&#x7B4B;&#x6597;&#x4E91;&#x628A;&#x4ED6;&#x9001;&#x53BB;&#x666E;&#x5EA6;&#x4F17;&#x751F;&#x4E86;&#x3002;</p>
<p>&#x4F60;&#x542C;&#x89C1;&#x9694;&#x58C1;&#x5927;&#x5B66;&#x7684;&#x516C;&#x5B89;&#x5C40;&#x957F;&#x5E84;&#x4E25;&#x5730;&#x5BA3;&#x5E03;&#x4F60;&#x5C06;&#x6210;&#x4E3A;&#x201C;&#x6597;&#x6218;&#x80DC;&#x4F5B;&#x201D;&#x3002;</p>
<p>&#x4F60;&#x5634;&#x89D2;&#x9732;&#x51FA;&#x4E00;&#x4E1D;&#x7B11;&#x5BB9;&#xFF1A;</p>
<p>&#x73B0;&#x5728;&#xFF0C;&#x4F60;&#x7EC8;&#x4E8E;&#x4E5F;&#x662F;&#x201C;&#x81EA;&#x5DF1;&#x4EBA;&#x201D;&#x4E86;&#x3002;</p>

	
	
	
	
</div>
				
				

                <!-- Post Comments -->
                


            </div>

            <!-- Post Prev & Next Nav -->
            <nav class="material-nav mdl-color-text--grey-50 mdl-cell mdl-cell--12-col">
    
    <!-- Prev Nav -->
    
        <a href="/2017/12/13/逻辑回归并行化/" id="post_nav-newer" class="prev-content">
            <button class="mdl-button mdl-js-button mdl-js-ripple-effect mdl-button--icon mdl-color--white mdl-color-text--grey-900" role="presentation">
                <i class="material-icons">arrow_back</i>
            </button>
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            新篇
        </a>
    

    <!-- Section Spacer -->
    <div class="section-spacer"></div>

    <!-- Next Nav -->
    
        <a href="/2017/09/29/基本模型小结/" id="post_nav-older" class="next-content">
            旧篇
            &nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
            <button class="mdl-button mdl-js-button mdl-js-ripple-effect mdl-button--icon mdl-color--white mdl-color-text--grey-900" role="presentation">
                <i class="material-icons">arrow_forward</i>
            </button>
        </a>
    
</nav>
        </div>
    </div>

				
				
					<!-- Overlay For Active Sidebar -->
<div class="sidebar-overlay "></div>

<!-- Material sidebar -->
<aside id="sidebar" class="sidebar sidebar-colored  sidebar-fixed-left" role="navigation">
	<div id="sidebar-main">
	    <!-- Sidebar Header -->
		<div class="sidebar-header header-cover" style="background-image: url(/img/sidebar_header.png);">
    <!-- Top bar -->
    <div class="top-bar"></div>

    <!-- Sidebar toggle button -->
    <button type="button" class="sidebar-toggle mdl-button mdl-js-button mdl-js-ripple-effect mdl-button--icon" style="display: initial;" data-upgraded=",MaterialButton,MaterialRipple">
    <i class="material-icons">clear_all</i>
    <span class="mdl-button__ripple-container"><span class="mdl-ripple"></span></span></button>

    <!-- Sidebar Avatar -->
    <div class="sidebar-image">
        <img src="/img/zebra.png" alt="Mahome.liao's avatar">
    </div>

    <!-- Sidebar Email -->
    <a data-toggle="dropdown" class="sidebar-brand" href="#settings-dropdown">
        liao.mahome@gmail.com
        <b class="caret"></b>
    </a>
</div>

		<!-- Sidebar Navigation  -->
		<ul class="nav sidebar-nav">
    <!-- User dropdown  -->
    <li class="dropdown">
        <ul id="settings-dropdown" class="dropdown-menu">
			
                <li>
                    <a href="#" target="_blank" title="Email Me">
						<i class="material-icons sidebar-material-icons sidebar-indent-left1pc-element">email</i>
                        Email Me
                    </a>
                </li>
            
        </ul>
    </li>

    <!-- Homepage -->
    <li id="sidebar-first-li">
        <a href="/" target="_self">
            <i class="material-icons sidebar-material-icons">home</i>
             主页
        </a>
    </li>

    <!-- I'm Feeling Lucky -->
<!--
    <li class="dropdown">
        <a href="" target="_self">
            <i class="material-icons sidebar-material-icons">explore</i>
             sidebar.imlucky
        </a>
    </li>
-->

	
    <!-- Archives  -->
    <li class="dropdown">
        <a href="#" class="ripple-effect dropdown-toggle" data-toggle="dropdown">
            <i class="material-icons sidebar-material-icons">inbox</i>
             归档
            <b class="caret"></b>
        </a>
        <ul class="dropdown-menu">
            <li>
            <a class="sidebar_archives-link" href="/archives/2017/12/">十二月 2017<span class="sidebar_archives-count">3</span></a></li><li><a class="sidebar_archives-link" href="/archives/2017/10/">十月 2017<span class="sidebar_archives-count">1</span></a></li><li><a class="sidebar_archives-link" href="/archives/2017/09/">九月 2017<span class="sidebar_archives-count">1</span></a></li><li><a class="sidebar_archives-link" href="/archives/2017/08/">八月 2017<span class="sidebar_archives-count">3</span></a></li><li><a class="sidebar_archives-link" href="/archives/2017/07/">七月 2017<span class="sidebar_archives-count">2</span></a></li><li><a class="sidebar_archives-link" href="/archives/2017/06/">六月 2017<span class="sidebar_archives-count">5</span></a></li><li><a class="sidebar_archives-link" href="/archives/2017/05/">五月 2017<span class="sidebar_archives-count">3</span></a></li><li><a class="sidebar_archives-link" href="/archives/2017/04/">四月 2017<span class="sidebar_archives-count">2</span></a></li><li><a class="sidebar_archives-link" href="/archives/2017/03/">三月 2017<span class="sidebar_archives-count">5</span></a></li><li><a class="sidebar_archives-link" href="/archives/2016/12/">十二月 2016<span class="sidebar_archives-count">3</span></a></li><li><a class="sidebar_archives-link" href="/archives/2016/11/">十一月 2016<span class="sidebar_archives-count">2</span></a></li><li><a class="sidebar_archives-link" href="/archives/2016/10/">十月 2016<span class="sidebar_archives-count">1</span></a></li><li><a class="sidebar_archives-link" href="/archives/2016/09/">九月 2016<span class="sidebar_archives-count">4</span></a></li><li><a class="sidebar_archives-link" href="/archives/2016/08/">八月 2016<span class="sidebar_archives-count">4</span></a></li><li><a class="sidebar_archives-link" href="/archives/2016/07/">七月 2016<span class="sidebar_archives-count">3</span></a>
        </ul>
    </li>

    <!-- Divider -->
    <li class="divider"></li>


    <!-- Pages  -->
	

    <!-- Article Numebr  -->
    <li>
        <a href="/archives">
             文章总数
             <span class="sidebar-badge">42</span>
        </a>
    </li>
</ul>

		<!-- Sidebar Divider -->
		<div class="sidebar-divider"></div>

		<!-- Sidebar Footer -->
		<!-- 
I'm glad you use this theme, the development is no so easy, I hope you can keep the copyright, I will thank you so much.
If you still want to delete the copyrights, could you still retain the first one? Which namely "Theme Material"
It will not impact the appearance and can give developers a lot of support :)

很高兴您使用并喜欢该主题，开发不易 十分谢谢与希望您可以保留一下版权声明。
如果您仍然想删除的话 能否只保留第一项呢？即 "Theme Material"
它不会影响美观并可以给开发者很大的支持。 :) 
-->

<!-- Theme Material -->
<a href="https://github.com/viosey/hexo-theme-material"  class="sidebar-footer-text-a" target="_blank">
	<div class="sidebar-text mdl-button mdl-js-button mdl-js-ripple-effect sidebar-footer-text-div" data-upgraded=",MaterialButton,MaterialRipple">
		主题 - Material
		<span class="sidebar-badge badge-circle">i</span>
	</div>
</a>

<!-- Help & Support -->
<!--
<a href="mailto:hiviosey@gmail.com" class="sidebar-footer-text-a">
    <div class="sidebar-text mdl-button mdl-js-button mdl-js-ripple-effect sidebar-footer-text-div" data-upgraded=",MaterialButton,MaterialRipple">
		sidebar.help
		<span class="mdl-button__ripple-container">
			<span class="mdl-ripple"></span>
		</span>
	</div>
</a>
-->

<!-- Feedback -->
<!--
<a href="https://github.com/viosey/hexo-theme-material/issues" target="_blank" class="sidebar-footer-text-a">
    <div class="sidebar-text mdl-button mdl-js-button mdl-js-ripple-effect sidebar-footer-text-div" data-upgraded=",MaterialButton,MaterialRipple">
         sidebar.feedback
                    <span class="mdl-button__ripple-container"><span class="mdl-ripple"></span></span></div>
</a>
-->

<!-- Abount Theme -->
<!--
<a href="https://blog.viosey.com/index.php/Material.html" target="_blank" class="sidebar-footer-text-a">
    <div class="sidebar-text mdl-button mdl-js-button mdl-js-ripple-effect sidebar-footer-text-div" data-upgraded=",MaterialButton,MaterialRipple">
         sidebar.about_theme
        <span class="mdl-button__ripple-container"><span class="mdl-ripple"></span></span></div>
</a>-->

	</div>
    
    <!-- Sidebar Sponsor -->
    


</aside>

				
				
				
					<!-- Footer Top Button -->
					<div class="toTop-wrap">
    <a href="#top" class="toTop">
        <i class="material-icons footer_top-i">expand_less</i>
    </a>
</div>
				
				
				<!--Footer-->
<footer class="mdl-mini-footer" id="bottom">
	
	
		<!-- Paradox Footer Left Section -->
		<div class="mdl-mini-footer--left-section sns-list">
    <!-- Twitter -->
    
    
    
    <!-- Facebook -->
    
    <a href="https://www.facebook.com/facebook" target="view_window"><button class="mdl-mini-footer--social-btn social-btn" style="background-image: url(/img/footer/footer_ico-facebook.png);">
        <span class="visuallyhidden">Facebook</span>
    </button></a>
    
    
    <!-- Google + -->
    
    <a href="https://www.google.com/" target="view_window"><button class="mdl-mini-footer--social-btn social-btn" style="background-image: url(/img/footer/footer_ico-gplus.png);">
        <span class="visuallyhidden">Google Plus</span>
    </button></a>
    
    
    <!-- Weibo -->
    
    
    
    <!-- Instagram -->
    
    
    
    <!-- Tumblr -->
    
    
    
    <!-- Github -->
    
    
</div>


		<!--Copyright-->
		<div id="copyright">Copyright&nbsp;©&nbsp;<script type="text/javascript">var fd = new Date();document.write(fd.getFullYear());</script>&nbsp;AI</div>

		<!-- Paradox Footer Right Section -->

		<!-- 
		I'm glad you use this theme, the development is no so easy, I hope you can keep the copyright.
		It will not impact the appearance and can give developers a lot of support :)

		很高兴您使用该主题，开发不易，希望您可以保留一下版权声明。
		它不会影响美观并可以给开发者很大的支持。 :) 
		-->

		<div class="mdl-mini-footer--right-section">
			<div>
				<div class="footer-develop-div">Powered by <a href="https://hexo.io" target="_blank" class="footer-develop-a">Hexo</a></div>
				<div class="footer-develop-div">Theme - <a href="https://github.com/viosey/hexo-theme-material" target="_blank" class="footer-develop-a">Material</a></div>
			</div>
		</div>
	
</footer>
                
				<!-- Import File -->
<script src="/js/highlight.min.js"></script>
<script src="/js/js.min.js"></script>
<script src="/js/nprogress.js"></script>

<script type="text/javascript">
    NProgress.configure({
        showSpinner: true
    });
    NProgress.start();
    
    $('#nprogress .bar').css({
        'background': '#FF4081'
    });
    $('#nprogress .peg').css({
        'box-shadow': '0 0 10px #FF4081, 0 0 15px #FF4081'
    });
    $('#nprogress .spinner-icon').css({
        'border-top-color': '#FF4081',
        'border-left-color': '#FF4081'
    });
    
    setTimeout(function() {
        NProgress.done();
        $('.fade').removeClass('out');
    }, 800);
</script>











<!-- Swiftye -->


<!-- Local Search-->


<!-- Window Load-->
<script>
    $(window).load(function() {
        // Post_Toc parent position fixed
        $(".post-toc-wrap").parent(".mdl-menu__container").css("position", "fixed");
    });
</script>

<!-- MathJax Load-->

            </main>
        </div><!-- hexo-inject:begin --><!-- Begin: Injected MathJax -->
<script type="text/x-mathjax-config">
  MathJax.Hub.Config({"tex2jax":{"inlineMath":[["$","$"],["\\(","\\)"]],"skipTags":["script","noscript","style","textarea","pre","code"],"processEscapes":true},"TeX":{"equationNumbers":{"autoNumber":"AMS"}}});
</script>

<script type="text/x-mathjax-config">
  MathJax.Hub.Queue(function() {
    var all = MathJax.Hub.getAllJax(), i;
    for(i=0; i < all.length; i += 1) {
      all[i].SourceElement().parentNode.className += ' has-jax';
    }
  });
</script>

<script type="text/javascript" src="//cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML">
</script>
<!-- End: Injected MathJax -->
<!-- hexo-inject:end -->
		
    </body>
		
	
</html>
